OpenNuvoton/M55M1BSP/Library/StdDriver/src/qspi.c
/**************************************************************************//**
 * @file     qspi.c
 * @version  V1.00
 * @brief    QSPI driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup QSPI_Driver QSPI Driver
  @{
*/

/** @addtogroup QSPI_EXPORTED_FUNCTIONS QSPI Exported Functions
  @{
*/

/* Set PCLK as the clock source of QSPI */
static void QSPI_SetPCLKSrc(const QSPI_T *qspi)
{
    if (qspi == QSPI0)
    {
        CLK->QSPISEL = (CLK->QSPISEL & ~(CLK_QSPISEL_QSPI0SEL_Msk)) | (CLK_QSPISEL_QSPI0SEL_PCLK0);
    }
    else
    {
        CLK->QSPISEL = (CLK->QSPISEL & ~(CLK_QSPISEL_QSPI1SEL_Msk)) | (CLK_QSPISEL_QSPI1SEL_PCLK2);
    }
}

/* Get the PCLK clock frequency of QSPI */
static uint32_t QSPI_GetPCLKSrcFreq(const QSPI_T *qspi)
{
    uint32_t u32RetValue = 0;

    if (qspi == QSPI0)
    {
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else
    {
        u32RetValue = CLK_GetPCLK2Freq();
    }

    return u32RetValue;
}

/**
 * @brief Get QSPI Clock Source Frequency.
 *
 * @param qspi      The pointer of the specified QSPI module.
 * @return uint32_t Clock Frequency
 */
static uint32_t QSPI_GetModuleClkSrcFrq(const QSPI_T *qspi)
{
    uint32_t u32QSPIClkSrcSel = 0UL;
    uint32_t u32RetValue = 0UL;

    /* Get QSPI clock source selection */
    if (qspi == QSPI0)
    {
        u32QSPIClkSrcSel = ((CLK->QSPISEL & CLK_QSPISEL_QSPI0SEL_Msk) >> CLK_QSPISEL_QSPI0SEL_Pos);
    }
    else if (qspi == QSPI1)
    {
        u32QSPIClkSrcSel = ((CLK->QSPISEL & CLK_QSPISEL_QSPI1SEL_Msk) >> CLK_QSPISEL_QSPI1SEL_Pos);
    }
    else
    {
        u32QSPIClkSrcSel = QSPI_CLKSEL_HXT;
    }

    switch (u32QSPIClkSrcSel)
    {
        case QSPI_CLKSEL_HXT:
            u32RetValue = __HXT;                            /* Clock source is HXT */
            break;

        case QSPI_CLKSEL_APLL0_DIV2:
            u32RetValue = (CLK_GetAPLL0ClockFreq() >> 1);   /* Clock source is APLL0 */
            break;

        case QSPI_CLKSEL_PCLK:
            u32RetValue = QSPI_GetPCLKSrcFreq(qspi);        /* Clock source is PCLK */
            break;

        case QSPI_CLKSEL_HIRC:
            u32RetValue = __HIRC;                           /* Clock source is HIRC 12Mhz */
            break;

        case QSPI_CLKSEL_HIRC48M_DIV4:
            u32RetValue = ((uint32_t)__HIRC48M / 4U);                  /* Clock source is HIRC 48Mhz / 4 */
            break;

        default:
            u32RetValue = __HXT;                            /* Clock source is HXT */
            break;
    }

    return u32RetValue;
}

/**
  * @brief  This function make QSPI module be ready to transfer.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @param[in]  u32MasterSlave Decides the QSPI module is operating in master mode or in slave mode. (QSPI_SLAVE, QSPI_MASTER)
  * @param[in]  u32QSPIMode Decides the transfer timing. (QSPI_MODE_0, QSPI_MODE_1, QSPI_MODE_2, QSPI_MODE_3)
  * @param[in]  u32DataWidth Decides the data width of a QSPI transaction.
  * @param[in]  u32BusClock The expected frequency of QSPI bus clock in Hz.
  * @return Actual frequency of QSPI peripheral clock.
  * @details By default, the QSPI transfer sequence is MSB first, the slave selection signal is active low and the automatic
  *          slave selection function is disabled.
  *          In Slave mode, the u32BusClock shall be NULL and the QSPI clock divider setting will be 0.
  *          The actual clock rate may be different from the target QSPI clock rate.
  *          For example, if the QSPI source clock rate is 12 MHz and the target QSPI bus clock rate is 7 MHz, the
  *          actual QSPI clock rate will be 6MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, QSPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= QSPI peripheral clock source, DIVIDER will be set to 0.
  * @note   In slave mode, the QSPI peripheral clock rate will be equal to APB clock rate.
  */
uint32_t QSPI_Open(QSPI_T *qspi, uint32_t u32MasterSlave, uint32_t u32QSPIMode, uint32_t u32DataWidth, uint32_t u32BusClock)
{
    uint32_t u32RetValue = 0UL;
    uint32_t u32DataWidthTmp = 0UL;

    if ((u32DataWidth < 8UL) && (u32DataWidth > 0UL))
    {
        u32DataWidthTmp = 8UL;
    }
    else if (u32DataWidth >= 32UL)
    {
        u32DataWidthTmp = 0UL;
    }
    else
    {
        u32DataWidthTmp = u32DataWidth;
    }

    if (u32MasterSlave == QSPI_MASTER)
    {
        /* Default setting: slave selection signal is active low; disable automatic slave selection function. */
        qspi->SSCTL = QSPI_SS_ACTIVE_LOW;

        /* Default setting: MSB first, disable unit transfer interrupt, SP_CYCLE = 0. */
        qspi->CTL = (u32MasterSlave);
        qspi->CTL |= ((u32DataWidthTmp << QSPI_CTL_DWIDTH_Pos) |
                      (u32QSPIMode) |
                      QSPI_CTL_QSPIEN_Msk);

        // Set the bus clock for the QSPI module and store the actual frequency in u32RetValue
        u32RetValue = QSPI_SetBusClock(qspi, u32BusClock);
    }
    else     /* For slave mode, force the QSPI peripheral clock rate to equal APB clock rate. */
    {
        /* Default setting: slave selection signal is low level active. */
        qspi->SSCTL = QSPI_SS_ACTIVE_LOW;

        /* Default setting: MSB first, disable unit transfer interrupt, SP_CYCLE = 0. */
        qspi->CTL = (u32MasterSlave);
        qspi->CTL |= ((u32DataWidthTmp << QSPI_CTL_DWIDTH_Pos) |
                      (u32QSPIMode) |
                      QSPI_CTL_QSPIEN_Msk);

        /* Set DIVIDER = 0 */
        qspi->CLKDIV = 0UL;

        /* Get the PCLK clock frequency of QSPI */
        u32RetValue = QSPI_GetPCLKSrcFreq(qspi);
    }

    return u32RetValue;
}

/**
  * @brief  Disable QSPI controller.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @details This function will reset QSPI controller.
  */
void QSPI_Close(const QSPI_T *qspi)
{
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (u32RegLockLevel)
    {
        /* Unlock protected registers */
        SYS_UnlockReg();
    }

    /* Reset QSPI */
    if (qspi == QSPI0)
    {
        SYS_ResetModule(SYS_QSPI0RST);
    }
    else
    {
        SYS_ResetModule(SYS_QSPI1RST);
    }

    if (u32RegLockLevel)
    {
        /* Lock protected registers */
        SYS_LockReg();
    }
}

/**
  * @brief  Clear RX FIFO buffer.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @details This function will clear QSPI RX FIFO buffer. The RXEMPTY (QSPI_STATUS[8]) will be set to 1.
  */
void QSPI_ClearRxFIFO(QSPI_T *qspi)
{
    qspi->FIFOCTL |= QSPI_FIFOCTL_RXFBCLR_Msk;
}

/**
  * @brief  Clear TX FIFO buffer.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @details This function will clear QSPI TX FIFO buffer. The TXEMPTY (QSPI_STATUS[16]) will be set to 1.
  * @note The TX shift register will not be cleared.
  */
void QSPI_ClearTxFIFO(QSPI_T *qspi)
{
    qspi->FIFOCTL |= QSPI_FIFOCTL_TXFBCLR_Msk;
}

/**
  * @brief  Disable the automatic slave selection function.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @details This function will disable the automatic slave selection function and set slave selection signal to inactive state.
  */
void QSPI_DisableAutoSS(QSPI_T *qspi)
{
    qspi->SSCTL &= ~(QSPI_SSCTL_AUTOSS_Msk | QSPI_SSCTL_SS_Msk);
}

/**
  * @brief  Enable the automatic slave selection function.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @param[in]  u32SSPinMask Specifies slave selection pins. (QSPI_SS)
  * @param[in]  u32ActiveLevel Specifies the active level of slave selection signal. (QSPI_SS_ACTIVE_HIGH, QSPI_SS_ACTIVE_LOW)
  * @details This function will enable the automatic slave selection function. Only available in Master mode.
  *          The slave selection pin and the active level will be set in this function.
  */
void QSPI_EnableAutoSS(QSPI_T *qspi, uint32_t u32SSPinMask, uint32_t u32ActiveLevel)
{
    qspi->SSCTL = (qspi->SSCTL & (~(QSPI_SSCTL_AUTOSS_Msk | QSPI_SSCTL_SSACTPOL_Msk | QSPI_SSCTL_SS_Msk))) |
                  (u32SSPinMask | u32ActiveLevel | QSPI_SSCTL_AUTOSS_Msk);
}

/**
  * @brief  Set the QSPI bus clock.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @param[in]  u32BusClock The expected frequency of QSPI bus clock in Hz.
  * @return Actual frequency of QSPI bus clock.
  * @details This function is only available in Master mode. The actual clock rate may be different from the target QSPI bus clock rate.
  *          For example, if the QSPI source clock rate is 12 MHz and the target QSPI bus clock rate is 7 MHz, the actual QSPI bus clock
  *          rate will be 6 MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, QSPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= QSPI peripheral clock source, DIVIDER will be set to 0.
  */
uint32_t QSPI_SetBusClock(QSPI_T *qspi, uint32_t u32BusClock)
{
    uint32_t u32ClkSrc = 0UL;
    uint32_t u32HCLKFreq = 0UL;
    uint32_t u32RetValue = 0UL;

    /* Get system clock frequency */
    u32HCLKFreq = CLK_GetSCLKFreq();

    if (u32BusClock >= u32HCLKFreq)
    {
        /* Select PCLK as the clock source of QSPI */
        QSPI_SetPCLKSrc(qspi);
    }

    /* Get clock source of QSPI */
    u32ClkSrc = QSPI_GetModuleClkSrcFrq(qspi);

    if (u32BusClock >= u32HCLKFreq)
    {
        /* Set DIVIDER = 0 */
        qspi->CLKDIV = 0UL;
        /* Return master peripheral clock rate */
        u32RetValue = u32ClkSrc;
    }
    else if (u32BusClock >= u32ClkSrc)
    {
        /* Set DIVIDER = 0 */
        qspi->CLKDIV = 0UL;
        /* Return master peripheral clock rate */
        u32RetValue = u32ClkSrc;
    }
    else if (u32BusClock == 0U)
    {
        /* Set DIVIDER to the maximum value. f_qspi = f_qspi_clk_src / (DIVIDER + 1) */
        qspi->CLKDIV |= QSPI_CLKDIV_DIVIDER_Msk;
        /* Return master peripheral clock rate */
        u32RetValue = (u32ClkSrc / ((QSPI_CLKDIV_DIVIDER_Msk >> QSPI_CLKDIV_DIVIDER_Pos) + 1U));
    }
    else
    {
        uint32_t u32Div = 0UL;

        u32Div = ((((u32ClkSrc * 10U) / (u32BusClock + 5U)) / 10U) - 1UL); /* Round to the nearest integer */

